
const frequencies_en = { // частоты символов русского и английского алфавитов
    'a': 0.0817, 'b': 0.0149, 'c': 0.0278, 'd': 0.0425, 'e': 0.127, 'f': 0.0223,
    'g': 0.0202, 'h': 0.0609, 'i': 0.0697, 'j': 0.0015, 'k': 0.0077, 'l': 0.0403,
    'm': 0.0241, 'n': 0.0675, 'o': 0.0751, 'p': 0.0193, 'q': 0.001, 'r': 0.0599,
    's': 0.0633, 't': 0.0906, 'u': 0.0276, 'v': 0.0098, 'w': 0.0236, 'x': 0.0015,
    'y': 0.0197, 'z': 0.0005
};
const frequencies_ru = {
    'а': 0.0801, 'б': 0.0159, 'в': 0.0454, 'г': 0.0170, 'д': 0.0298, 'е': 0.0845,
    'ё': 0.0004, 'ж': 0.0094, 'з': 0.0165, 'и': 0.0735, 'й': 0.0121, 'к': 0.0349,
    'л': 0.044, 'м': 0.0321, 'н': 0.067, 'о': 0.1097, 'п': 0.0281, 'р': 0.0473,
    'с': 0.0547, 'т': 0.0626, 'у': 0.0262, 'ф': 0.0026, 'х': 0.0097, 'ц': 0.0048,
    'ч': 0.0144, 'ш': 0.0073, 'щ': 0.0036, 'ъ': 0.0004, 'ы': 0.019, 'ь': 0.0174,
    'э': 0.0032, 'ю': 0.0064, 'я': 0.0201
};

function caesar_decrypt(frequencies, text)
{
    let letters = Object.keys(frequencies);
    let textLettersCount = 0;
    let textFrequencies = {};
    let letter;

    letters.forEach((letter => textFrequencies[letter] = 0));
    for (let i = 0; i < text.length; i++)
    {
        letter = text[i].toLowerCase();
        if (letters.includes(letter))
        {
            textLettersCount++;
            textFrequencies[letter]++;
        }
    }
    letters.forEach((letter) => textFrequencies[letter] /= textLettersCount );

    let minValue = Number.POSITIVE_INFINITY;
    let shift = 0;
    let functionalResult;
    for (let i = 0; i < letters.length; i++)
    {
        functionalResult = 0;
        for (let j = 0; j < letters.length; j++)
            functionalResult += Math.abs(frequencies[letters[j]]
                - textFrequencies[letters[(j + i) % letters.length]]);
        if (functionalResult < minValue)
        {
            minValue = functionalResult;
            shift = i;
        }
    }

    console.log('the most probable shift is '+shift);

    let result = "";
    for (let i = 0; i < text.length; i++)
        if (letters.includes(text[i].toLowerCase()))
            result += letters[ (letters.indexOf(text[i].toLowerCase()) + letters.length - shift) % letters.length];
        else
            result += text[i];
    return result;
}


console.log(caesar_decrypt(frequencies_ru, `Хмщфцъшж хз рпймщърм ц йпжърр ьумамс, Хзчцумцх йрлму, яъц еъц игуц хм ъц, щцйщмф хм ъц, яъц игуц йц йщмэ мкц чшмохрэ щшзомхржэ. Цх йрлму, яъц ъц ом яыйщъйц, тцъцшцм рщчгъгйзу цх, рщчгъгйзур р йщм мкц цтшыозёбрм уёлр, цчгъхгм й лмум щшзомхрс. Йщм урюз игур чмязудхг, йщм кузпз рпимкзур лшык лшыкз. Ъцудтц цлхр Ицщщм хм фцк чцхрфзъд пхзямхрж ъцкц, яъц щцймшазуцщд. Хзчцумцх ом чцщум щйцмкц лцукцкц цчгъз йцсхг пхзу эцшцац, яъц пхзяруц й чшцлцуомхрм йцщдфр язщцй, чцщум йщмэ ычцъшмиумххгэ ыщрурс, хмйгркшзххцм зъзтыёбрф щшзомхрм. Цх пхзу, яъц еъц игуц чцяър чшцркшзххцм щшзомхрм р яъц фзумсазж щуыязсхцщъд фцкуз ъмчмшд — хз ъцс хзъжхыъцс ъцятм тцумизхрж, хз тцъцшцс щъцжуц щшзомхрм, — чцкыиръд мкц р мкц йцсщтз. Тцклз цх чмшмиршзу й йццишзомхрр йщё еъы щъшзххыё шыщщтыё тзфчзхрё, й тцъцшцс хм игуц йгркшзхц хр цлхцкц щшзомхдж, й тцъцшцс й лйз фмщжюз хм йпжъц хр пхзфмх, хр чыамт, хр тцшчыщцй йцсщт, тцклз кужлму хз щтшгъхц-чмязудхгм урюз цтшыозёбрэ р щуыазу лцхмщмхрж ц ъцф, яъц шыщщтрм йщн щъцжъ, — щъшзахцм яыйщъйц, чцлцихцм яыйщъйы, рщчгъгйзмфцфы й щхцйрлмхржэ, цэйзъгйзуц мкц, р мфы чшрэцлрур й кцуцйы йщм хмщязщъхгм щуыязсхцщър, фцкыбрм чцкыиръд мкц. Шыщщтрм фцкур чцчзщъд хз мкц умйцм тшгуц, фцкур шзпцшйзъд мкц щмшмлрхы, азудхцм жлшц фцкуц ыиръд мкц щзфцкц. Йщм еъц игуц йцпфцохц. Й чшмохрэ щшзомхржэ щйцрэ цх цилыфгйзу ъцудтц щуыязсхцщър ыщчмэз, ъмчмшд ом имщярщумххцм тцурямщъйц хмщязщъхгэ щуыязсхцщъмс чшмлщъзйужуцщд мфы, р цх цорлзу рэ йщмэ. Лз, еъц игуц тзт йц щхм, тцклз ямуцймты чшмлщъзйужмъщж хзщъычзёбрс хз хмкц пуцлмс, р ямуцймт йц щхм шзпфзэхыущж р ылзшру щйцмкц пуцлмж щ ъмф щъшзахгф ыщрурмф, тцъцшцм, цх пхзмъ, лцуохц ыхряъцоръд мкц, р яыйщъйымъ, яъц шытз мкц, имщщрудхзж р фжктзж, чзлзмъ тзт ъшжчтз, р ыозщ хмцъшзпрфцс чцкримур циэйзъгйзмъ имщчцфцбхцкц ямуцймтз. Рпймщърм ц ъцф, яъц шыщщтрм зъзтыёъ умйгс ьузхк ьшзхюыпщтцс зшфрр, йцпиылруц й Хзчцумцхм еъцъ ыозщ. Цх фцуяз щрлму чцл тышкзхцф хз щтузлхцф щъыум, цчыщърй кцуцйы р чцуцорй уцтър хз тцумхз. Имшъдм чцлцаму т хмфы р чшмлуцору чшцмэзъдщж чц урхрр, яъциг ыимлръдщж, й тзтцф чцуцомхрр хзэцлруцщд лмуц. — Яъц? Яъц йг кцйцшръм? — щтзпзу Хзчцумцх. — Лз, ймуръм чцлзъд фхм уцазлд. Цх щму ймшэцф р чцмэзу т Щмфмхцйщтцфы. Й фмлумххц шзщэцлрйамфщж чцшцэцйцф лгфм чц йщмфы ъцфы чшцщъшзхщъйы, чц тцъцшцфы мэзу Хзчцумцх, — й уыозэ тшцйр умозур уцазлр р уёлр, чццлрхцятм р тыязфр. Чцлцихцкц ыозщз, ъзтцкц тцурямщъйз ыиръгэ хз ъзтцф фзуцф чшцщъшзхщъйм хртцклз хм йрлзур мбм р Хзчцумцх, р хртъц рп мкц кмхмшзуцй. Кыу цшылрс, хм чмшмщъзйзйарс лмщжъд язщцй щшжлы р рпфыярйарс ыэц, чшрлзйзу цщцимххыё пхзяръмудхцщъд пшмурбы (тзт фыпгтз чшр орйгэ тзшърхзэ). Хзчцумцх йгмэзу хз йгщцъы Щмфмхцйщтцкц р щтйцпд лгф ыйрлзу шжлг уёлмс й фыхлршзэ юймъцй, хмчшрйгяхгэ луж мкц кузп. Еъц игур шыщщтрм. Шыщщтрм чуцъхгфр шжлзфр щъцжур чцпзлр Щмфмхцйщтцкц р тышкзхз, р рэ цшылрж хм чмшмщъзйзж кылмур р лгфрур чц рэ урхрр. Щшзомхрж ыом хм игуц. Игуц чшцлцуозйаммщж ыирсщъйц, тцъцшцм хр т ямфы хм фцкуц чцймщър хр шыщщтрэ, хр ьшзхюыпцй. Хзчцумцх цщъзхцйру уцазлд р йчзу цчжъд й ъы пзлыфярйцщъд, рп тцъцшцс йгйму мкц Имшъдм; цх хм фцк цщъзхцйръд ъцкц лмуз, тцъцшцм лмузуцщд чмшмл хрф р йцтшык хмкц р тцъцшцм щяръзуцщд шытцйцлрфгф рф р пзйрщжбрф цъ хмкц, р лмуц еъц мфы й чмшйгс шзп, йщумлщъйрм хмыщчмэз, чшмлщъзйужуцщд хмхыохгф р ыозщхгф. Цлрх рп кмхмшзуцй, чцлвмэзйарэ т Хзчцумцхы, чцпйцуру щмим чшмлуцоръд мфы йймщър й лмуц щъзшыё кйзшлрё. Хмс р Имшъдм, щъцжйарм чцлум Хзчцумцхз, чмшмкужхыурщд фмолы щцицс р чшмпшръмудхц ыугихыурщд хз имщщфгщумххцм чшмлуцомхрм еъцкц кмхмшзуз. Хзчцумцх цчыщъру кцуцйы р лцукц фцуязу.`));